app/views/rewards/index.html.erb

SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT 1  [["id", 3]]
---
      <th class="desc" width="75">Discount</th>
 	  <% if Role.find(current_user.role_id).name == 'Customer' %>