app/controllers/circles_controller.rb

SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "circles".* FROM "circles" WHERE "circles"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "circles".* FROM "circles"
---
  def index
  	if Role.find(current_user.role_id).name == 'Customer'
		@circles = Circle.where("id = ?",current_user.circle_id).all
	else
		@circles = Circle.all

INSERT INTO "circles" ("name", "group_code", "points", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Murphy Family"], ["group_code", "MUR0001"], ["points", 0], ["status", ""], ["created_at", "2015-05-07 15:53:04.905339"], ["updated_at", "2015-05-07 15:53:04.905339"]]
---
  def create
    @circle = Circle.new(circle_params)

    respond_to do |format|
      if @circle.save

SELECT  "circles".* FROM "circles" WHERE "circles"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_circle
      @circle = Circle.find(params[:id])