app/controllers/home_controller.rb

SELECT  "circles".* FROM "circles" WHERE "circles"."id" = $1 LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "policies" WHERE (user_id = 7)
---
	def index
		if Circle.find(current_user.circle_id).group_code == "Empty"
			redirect_to circles_join_path
		elsif Policy.where("user_id = ?", current_user.id).count == 0