app/controllers/policies_controller.rb

SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "policies".* FROM "policies" WHERE (user_id = 7)  ORDER BY "policies"."id" ASC
SELECT "policies".* FROM "policies"
---
  def index
    if Role.find(current_user.role_id).name == 'Customer'
		@policies = Policy.where("user_id = ?",current_user.id).all.order(:id)
    else
		@policies = Policy.all

INSERT INTO "policies" ("user_id", "product_id", "frequency", "premium", "policy_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create_multi_policies

	if (params[:policy_motor].to_s.length > 0)
		@policy1 = Policy.new
		@policy1.user_id = current_user.id
		@policy1.product_id = 2
		@policy1.frequency = "Monthly"
		@policy1.premium = rand(200.0..250.0).round(2)
		@policy1.policy_number = params[:policy_motor].to_s
		@policy1.save

DELETE FROM "policies" WHERE "policies"."id" = $1  [["id", 4]]
---
  def destroy
    @policy.destroy

SELECT  "policies".* FROM "policies" WHERE "policies"."id" = $1 LIMIT 1  [["id", 4]]
---
    def set_policy
      @policy = Policy.find(params[:id])