app/controllers/rewards_controller.rb

SELECT "rewards".* FROM "rewards" WHERE (offer_type = 'Discount')
---
  def index
    @discount_rewards = Reward.where("offer_type = 'Discount'").all

INSERT INTO "rewards" ("product_id", "offer_type", "min_circle_size", "min_circle_points", "title", "points_cost", "discount", "desc1", "desc2", "artwork_filename", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @reward = Reward.new(reward_params)

    respond_to do |format|
      if @reward.save

SELECT  "rewards".* FROM "rewards" WHERE "rewards"."id" = $1 LIMIT 1  [["id", 0]]
---
    def set_reward
      @reward = Reward.find(params[:id])