app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (circle_id == 3)  ORDER BY "users"."id" ASC
---
  def index
    @users = User.all